{
  "snacks": [
    {
      "name": 1,
      "price": "HTML5",
      "type": "HyperText Markup Language (version 5.)"
    },
    {
      "name": 2,
      "price": "CSS3",
      "type": "Cascading StyleSheets (version 3.)"
    },
    {
      "name": 3,
      "price": "Bootstrap",
      "type": "Bootstrap is a CSS framework, offering you a cornucopia of pre-set classes and styles out-of-the-box."
    },
    {
      "name": 4,
      "price": "Foundation",
      "type": "Foundation is a CSS framework, offering you a cornucopia of pre-set classes and styles out-of-the-box."
    },
    {
      "name": 5,
      "price": "Bulma",
      "type": "Bulma is a CSS framework, offering you a cornucopia of pre-set classes and styles out-of-the-box."
    },
    {
      "name": 6,
      "price": "Semantic UI",
      "type": "Foundation is a CSS framework, offering you a cornucopia of pre-set classes and styles out-of-the-box."
    },
    {
      "name": 7,
      "price": "JavaScript",
      "type": "Used for functionality, and handling of interactivity, in the front-end of websites."
    },
    {
      "name": 8,
      "price": "ECMAScript 6",
      "type": "A specific version of JavaScript that introduces new features like \"class\" arrow-style function."
    },
    {
      "name": 9,
      "price": "jQuery",
      "type": "A library intended to assist with backwards compatability, ease of JavaScript plugin creation, and simplification of code."
    },
    {
      "name": 10,
      "price": "Slick",
      "type": "A JavaScript library for easy sliders."
    },
    {
      "name": 11,
      "price": "ChartJS",
      "type": "A JavaScript library for easy charts."
    },
    {
      "name": 12,
      "price": "Axios",
      "type": "A JavaScript library for easy AJAX requests."
    },
    {
      "name": 13,
      "price": "TypeScript",
      "type": "A superset of JavaScript with enhanced types."
    },
    {
      "name": 14,
      "price": "React",
      "type": "A JavaScript library for managing the interactive \"view\" layer of a website application."
    },
    {
      "name": 15,
      "price": "Redux",
      "type": "When \"local\" state isn't enough, Redux provides a more \"global\" solution."
    },
    {
      "name": 16,
      "price": "PHP",
      "type": "PHP Hypertext Preprocessor language is used as a general-purpose and website application (server-side) solution."
    },
    {
      "name": 17,
      "price": "WordPress",
      "type": "The leading blogging platform on the web, powering more than 30% of websites; built in PHP."
    },
    {
      "name": 18,
      "price": "Databases",
      "type": "Used as a persistant storage solution, typically for web or software solutions."
    },
    {
      "name": 19,
      "price": "MySQL",
      "type": "A database management system utilizing an \"Structured Query Language\" for request formatting."
    },
    {
      "name": 20,
      "price": "C#",
      "type": "A programming language typically utilized for native desktop software or website applications."
    },
    {
      "name": 21,
      "price": ".NET CORE",
      "type": "A C# framework developed by Microsoft for accelerated web and desktop application development."
    }
  ]
}
